Applying:

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # grafana_api_key.terraform will be created
  + resource "grafana_api_key" "terraform" {
      + cloud_stack_slug = "ishanoloterraformdem"
      + expiration       = (known after apply)
      + id               = (known after apply)
      + key              = (sensitive value)
      + name             = "terraform"
      + role             = "Admin"
    }

  # grafana_cloud_stack.ishanterraformde will be created
  + resource "grafana_cloud_stack" "ishanterraformde" {
      + alertmanager_name                = (known after apply)
      + alertmanager_status              = (known after apply)
      + alertmanager_url                 = (known after apply)
      + alertmanager_user_id             = (known after apply)
      + id                               = (known after apply)
      + logs_name                        = (known after apply)
      + logs_status                      = (known after apply)
      + logs_url                         = (known after apply)
      + logs_user_id                     = (known after apply)
      + name                             = "ishanoloterraformdem"
      + org_id                           = (known after apply)
      + org_name                         = (known after apply)
      + org_slug                         = (known after apply)
      + prometheus_name                  = (known after apply)
      + prometheus_remote_endpoint       = (known after apply)
      + prometheus_remote_write_endpoint = (known after apply)
      + prometheus_status                = (known after apply)
      + prometheus_url                   = (known after apply)
      + prometheus_user_id               = (known after apply)
      + region_slug                      = "us"
      + slug                             = "ishanoloterraformdem"
      + status                           = (known after apply)
      + url                              = (known after apply)
      + wait_for_readiness               = true
    }

  # grafana_dashboard.influxdb["new-dashboard.json"] will be created
  + resource "grafana_dashboard" "influxdb" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "datasource"
                              + uid  = "grafana"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + description          = "Visualize Amazon EC2 metrics"
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + iteration            = 1655908908223
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + collapsed  = false
                      + datasource = {
                          + uid = "$datasource"
                        }
                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + panels     = []
                      + title      = "Overview"
                      + type       = "row"
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = {
                          + uid = "$datasource"
                        }
                      + fieldConfig     = {
                          + defaults  = {
                              + links = []
                            }
                          + overrides = []
                        }
                      + fill            = 1
                      + fillGradient    = 0
                      + gridPos         = {
                          + h = 8
                          + w = 24
                          + x = 0
                          + y = 1
                        }
                      + hiddenSeries    = false
                      + legend          = {
                          + alignAsTable = true
                          + avg          = true
                          + current      = false
                          + max          = false
                          + min          = false
                          + rightSide    = true
                          + show         = true
                          + sort         = "avg"
                          + sortDesc     = true
                          + total        = false
                          + values       = true
                        }
                      + lines           = true
                      + linewidth       = 1
                      + nullPointMode   = "connected"
                      + options         = {
                          + alertThreshold = true
                        }
                      + percentage      = false
                      + pluginVersion   = "9.0.1-b253e87pre"
                      + pointradius     = 2
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = []
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + alias            = ""
                              + dimensions       = {
                                  + InstanceId = "*"
                                }
                              + expression       = ""
                              + id               = ""
                              + matchExact       = true
                              + metricEditorMode = 0
                              + metricName       = "CPUUtilization"
                              + metricQueryType  = 0
                              + namespace        = "AWS/EC2"
                              + period           = "$period"
                              + refId            = "B"
                              + region           = "$region"
                              + statistic        = "Maximum"
                            },
                        ]
                      + thresholds      = []
                      + timeRegions     = []
                      + title           = "CPU utilization per instance [max %]"
                      + tooltip         = {
                          + shared     = true
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "percent"
                              + label   = ""
                              + logBase = 1
                              + max     = "100"
                              + min     = "0"
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align = false
                        }
                    },
                  + {
                      + aliasColors     = {}
                      + bars            = false
                      + dashLength      = 10
                      + dashes          = false
                      + datasource      = {
                          + uid = "$datasource"
                        }
                      + fieldConfig     = {
                          + defaults  = {
                              + links = []
                            }
                          + overrides = []
                        }
                      + fill            = 1
                      + fillGradient    = 0
                      + gridPos         = {
                          + h = 9
                          + w = 24
                          + x = 0
                          + y = 9
                        }
                      + hiddenSeries    = false
                      + legend          = {
                          + alignAsTable = false
                          + avg          = false
                          + current      = false
                          + max          = false
                          + min          = false
                          + show         = false
                          + total        = false
                          + values       = false
                        }
                      + lines           = true
                      + linewidth       = 1
                      + nullPointMode   = "connected"
                      + options         = {
                          + alertThreshold = true
                        }
                      + percentage      = false
                      + pluginVersion   = "9.0.1-b253e87pre"
                      + pointradius     = 2
                      + points          = false
                      + renderer        = "flot"
                      + seriesOverrides = [
                          + {
                              + alias     = "Inbound"
                              + transform = "negative-Y"
                            },
                        ]
                      + spaceLength     = 10
                      + stack           = false
                      + steppedLine     = false
                      + targets         = [
                          + {
                              + alias            = "Inbound"
                              + dimensions       = {
                                  + InstanceId = "*"
                                }
                              + expression       = "SUM(REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkIn\"', 'Sum', $period)))/$period"
                              + id               = ""
                              + matchExact       = true
                              + metricEditorMode = 1
                              + metricName       = "NetworkOut"
                              + metricQueryType  = 0
                              + namespace        = "AWS/EC2"
                              + period           = "$period"
                              + refId            = "B"
                              + region           = "$region"
                              + statistic        = "Average"
                            },
                          + {
                              + alias            = "Outbound"
                              + dimensions       = {
                                  + InstanceId = "*"
                                }
                              + expression       = "SUM(REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkOut\"', 'Sum', $period)))/$period"
                              + id               = ""
                              + matchExact       = true
                              + metricEditorMode = 1
                              + metricName       = "NetworkOut"
                              + metricQueryType  = 0
                              + namespace        = "AWS/EC2"
                              + period           = "$period"
                              + refId            = "C"
                              + region           = "$region"
                              + statistic        = "Average"
                            },
                        ]
                      + thresholds      = []
                      + timeRegions     = []
                      + title           = "Total network traffic outbound (+) and inbound (-) [bytes/sec]"
                      + tooltip         = {
                          + shared     = true
                          + sort       = 0
                          + value_type = "individual"
                        }
                      + type            = "graph"
                      + xaxis           = {
                          + mode   = "time"
                          + show   = true
                          + values = []
                        }
                      + yaxes           = [
                          + {
                              + format  = "short"
                              + logBase = 1
                              + show    = true
                            },
                          + {
                              + format  = "short"
                              + logBase = 1
                              + min     = "0"
                              + show    = true
                            },
                        ]
                      + yaxis           = {
                          + align = false
                        }
                    },
                  + {
                      + collapsed  = true
                      + datasource = {
                          + uid = "$datasource"
                        }
                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 18
                        }
                      + panels     = [
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 0
                                  + y = 19
                                }
                              + hiddenSeries    = false
                              + id              = 17
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = false
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkIn\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "NetworkIn"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Inbound network traffic per instance [bytes/sec]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 12
                                  + y = 19
                                }
                              + hiddenSeries    = false
                              + id              = 18
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = false
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkOut\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "NetworkIn"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Outbound network traffic per instance [bytes/sec]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 0
                                  + y = 28
                                }
                              + hiddenSeries    = false
                              + id              = 9
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = false
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkPacketsIn\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "NetworkPacketsIn"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Inbound network packets per instance [IOPS]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 12
                                  + y = 28
                                }
                              + hiddenSeries    = false
                              + id              = 19
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = false
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"NetworkPacketsOut\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "NetworkPacketsIn"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Outbound network packets per instance [IOPS]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                        ]
                      + title      = "Network details"
                      + type       = "row"
                    },
                  + {
                      + collapsed  = true
                      + datasource = {
                          + uid = "$datasource"
                        }
                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 19
                        }
                      + panels     = [
                          + {
                              + content    = ""
                              + datasource = {
                                  + uid = "$datasource"
                                }
                              + gridPos    = {
                                  + h = 1
                                  + w = 24
                                  + x = 0
                                  + y = 38
                                }
                              + id         = 30
                              + mode       = "markdown"
                              + options    = {}
                              + title      = "The following metrics are reported for EC2 Instance Store Volumes. For Amazon EBS volumes, see the EBS dashboard."
                              + type       = "text"
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 0
                                  + y = 39
                                }
                              + hiddenSeries    = false
                              + id              = 3
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "null as zero"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = "{{label}}"
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskReadBytes\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "DiskReadBytes"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Disk READ per instance [bytes/sec]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 12
                                  + y = 39
                                }
                              + hiddenSeries    = false
                              + id              = 22
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "null as zero"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = "{{label}}"
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskWriteBytes\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "DiskReadBytes"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Disk WRITE per instance [bytes/sec]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 0
                                  + y = 48
                                }
                              + hiddenSeries    = false
                              + id              = 24
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "null as zero"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = "{{label}}"
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskReadOps\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "DiskReadBytes"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Disk READ per instance [IOPS]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + description     = ""
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 9
                                  + w = 12
                                  + x = 12
                                  + y = 48
                                }
                              + hiddenSeries    = false
                              + id              = 23
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "null as zero"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = "{{label}}"
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = "REMOVE_EMPTY(SEARCH('{AWS/EC2,InstanceId} MetricName=\"DiskWriteOps\"', 'Sum', $period))/$period"
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 1
                                      + metricName       = "DiskReadBytes"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Disk WRITE per instance [IOPS]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                        ]
                      + title      = "Disk details"
                      + type       = "row"
                    },
                  + {
                      + collapsed  = true
                      + datasource = {
                          + uid = "$datasource"
                        }
                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 20
                        }
                      + panels     = [
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + description     = ""
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 6
                                  + w = 24
                                  + x = 0
                                  + y = 58
                                }
                              + hiddenSeries    = false
                              + id              = 10
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = ""
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 0
                                      + metricName       = "StatusCheckFailed"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Status check failed [Sum]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + description     = ""
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 6
                                  + w = 24
                                  + x = 0
                                  + y = 64
                                }
                              + hiddenSeries    = false
                              + id              = 27
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = ""
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 0
                                      + metricName       = "StatusCheckFailed"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "Instance status check failed [Sum]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                          + {
                              + aliasColors     = {}
                              + bars            = false
                              + dashLength      = 10
                              + dashes          = false
                              + datasource      = {
                                  + uid = "$datasource"
                                }
                              + description     = ""
                              + fill            = 1
                              + fillGradient    = 0
                              + gridPos         = {
                                  + h = 6
                                  + w = 24
                                  + x = 0
                                  + y = 70
                                }
                              + hiddenSeries    = false
                              + id              = 28
                              + legend          = {
                                  + alignAsTable = false
                                  + avg          = false
                                  + current      = false
                                  + max          = false
                                  + min          = false
                                  + rightSide    = true
                                  + show         = true
                                  + total        = false
                                  + values       = false
                                }
                              + lines           = true
                              + linewidth       = 1
                              + nullPointMode   = "connected"
                              + options         = {
                                  + dataLinks = []
                                }
                              + percentage      = false
                              + pointradius     = 2
                              + points          = false
                              + renderer        = "flot"
                              + seriesOverrides = []
                              + spaceLength     = 10
                              + stack           = false
                              + steppedLine     = true
                              + targets         = [
                                  + {
                                      + alias            = ""
                                      + dimensions       = {
                                          + InstanceId = "*"
                                        }
                                      + expression       = ""
                                      + id               = ""
                                      + matchExact       = true
                                      + metricEditorMode = 0
                                      + metricName       = "StatusCheckFailed"
                                      + metricQueryType  = 0
                                      + namespace        = "AWS/EC2"
                                      + period           = "$period"
                                      + refId            = "A"
                                      + region           = "$region"
                                      + statistic        = "Sum"
                                    },
                                ]
                              + thresholds      = []
                              + timeRegions     = []
                              + title           = "System status check failed [Sum]"
                              + tooltip         = {
                                  + shared     = true
                                  + sort       = 0
                                  + value_type = "individual"
                                }
                              + type            = "graph"
                              + xaxis           = {
                                  + mode   = "time"
                                  + show   = true
                                  + values = []
                                }
                              + yaxes           = [
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + min     = "0"
                                      + show    = true
                                    },
                                  + {
                                      + format  = "short"
                                      + logBase = 1
                                      + show    = true
                                    },
                                ]
                              + yaxis           = {
                                  + align = false
                                }
                            },
                        ]
                      + title      = "Status Checks"
                      + type       = "row"
                    },
                  + {
                      + collapsed  = false
                      + datasource = {
                          + uid = "$datasource"
                        }
                      + gridPos    = {
                          + h = 1
                          + w = 24
                          + x = 0
                          + y = 21
                        }
                      + panels     = []
                      + title      = "Information"
                      + type       = "row"
                    },
                  + {
                      + datasource    = {
                          + uid = "$datasource"
                        }
                      + gridPos       = {
                          + h = 4
                          + w = 24
                          + x = 0
                          + y = 22
                        }
                      + options       = {
                          + content = <<-EOT
                                For more information about avaialble metrics from Amazon EC2, visit the [List of Available CloudWatch Metrics for Your EC2 Instances](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/viewing_metrics_with_cloudwatch.html) in the Amazon documentation.
                                
                                For additional metrics and 1-minute granularity, enable [Detailed Monitoring](https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-cloudwatch-new.html) for your Amazon EC2 instances.
                                
                                This dashboard has been optimized for 1-minute metrics.
                            EOT
                          + mode    = "markdown"
                        }
                      + pluginVersion = "9.0.1-b253e87pre"
                      + targets       = [
                          + {
                              + alias            = ""
                              + dimensions       = {}
                              + expression       = ""
                              + id               = ""
                              + matchExact       = true
                              + metricEditorMode = 0
                              + metricName       = ""
                              + metricQueryType  = 0
                              + namespace        = ""
                              + refId            = "A"
                              + region           = "default"
                              + statistic        = "Average"
                            },
                        ]
                      + title         = " "
                      + type          = "text"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = [
                  + "Amazon",
                  + "AWS",
                  + "CloudWatch",
                  + "EC2",
                ]
              + templating           = {
                  + list = [
                      + {
                          + current     = {
                              + selected = false
                              + text     = "CloudWatch"
                              + value    = "CloudWatch"
                            }
                          + hide        = 0
                          + includeAll  = false
                          + label       = "Data source"
                          + multi       = false
                          + name        = "datasource"
                          + options     = []
                          + query       = "cloudwatch"
                          + refresh     = 1
                          + regex       = ""
                          + skipUrlSync = false
                          + type        = "datasource"
                        },
                      + {
                          + current        = {
                              + selected = false
                              + text     = "default"
                              + value    = "default"
                            }
                          + datasource     = {
                              + type = "prometheus"
                              + uid  = "$datasource"
                            }
                          + definition     = "regions()"
                          + hide           = 0
                          + includeAll     = false
                          + label          = "Region"
                          + multi          = false
                          + name           = "region"
                          + options        = []
                          + query          = "regions()"
                          + refresh        = 1
                          + regex          = ""
                          + skipUrlSync    = false
                          + sort           = 0
                          + tagValuesQuery = ""
                          + tagsQuery      = ""
                          + type           = "query"
                          + useTags        = false
                        },
                      + {
                          + current     = {
                              + selected = true
                              + tags     = []
                              + text     = "300"
                              + value    = "300"
                            }
                          + hide        = 0
                          + includeAll  = false
                          + label       = "Period [sec]"
                          + multi       = false
                          + name        = "period"
                          + options     = [
                              + {
                                  + selected = false
                                  + text     = "60"
                                  + value    = "60"
                                },
                              + {
                                  + selected = true
                                  + text     = "300"
                                  + value    = "300"
                                },
                              + {
                                  + selected = false
                                  + text     = "3600"
                                  + value    = "3600"
                                },
                            ]
                          + query       = "60,300,3600"
                          + skipUrlSync = false
                          + type        = "custom"
                        },
                    ]
                }
              + time                 = {
                  + from = "now-6h"
                  + to   = "now"
                }
              + timepicker           = {
                  + refresh_intervals = [
                      + "5s",
                      + "10s",
                      + "30s",
                      + "1m",
                      + "5m",
                      + "15m",
                      + "30m",
                      + "1h",
                      + "2h",
                      + "1d",
                    ]
                }
              + timezone             = ""
              + title                = "Amazon EC2"
              + uid                  = "tmsOtSxZk"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.influxdb["sample-dashboard.json"] will be created
  + resource "grafana_dashboard" "influxdb" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "grafana"
                              + uid  = "-- Grafana --"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "xLNPLcX7z"
                        }
                      + description = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineStyle         = {
                                      + fill = "solid"
                                    }
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = [
                              + {
                                  + __systemRef = "hideSeriesFrom"
                                  + matcher     = {
                                      + id      = "byNames"
                                      + options = {
                                          + mode     = "exclude"
                                          + names    = [
                                              + "co TLM0102",
                                            ]
                                          + prefix   = "All except:"
                                          + readOnly = true
                                        }
                                    }
                                  + properties  = [
                                      + {
                                          + id    = "custom.hideFrom"
                                          + value = {
                                              + legend  = false
                                              + tooltip = false
                                              + viz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 17
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "xLNPLcX7z"
                                }
                              + query      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              + refId      = "A"
                            },
                        ]
                      + title       = "Air Sensors"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "2022-06-21T17:05:46.978Z"
                  + to   = "2022-06-21T17:53:35.857Z"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "InfluxDB Cloud Demos"
              + uid                  = "9uim8cunk"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_dashboard.influxdb["yo-dashboard.json"] will be created
  + resource "grafana_dashboard" "influxdb" {
      + config_json  = jsonencode(
            {
              + annotations          = {
                  + list = [
                      + {
                          + builtIn    = 1
                          + datasource = {
                              + type = "grafana"
                              + uid  = "-- Grafana --"
                            }
                          + enable     = true
                          + hide       = true
                          + iconColor  = "rgba(0, 211, 255, 1)"
                          + name       = "Annotations & Alerts"
                          + target     = {
                              + limit    = 100
                              + matchAny = false
                              + tags     = []
                              + type     = "dashboard"
                            }
                          + type       = "dashboard"
                        },
                    ]
                }
              + editable             = true
              + fiscalYearStartMonth = 0
              + graphTooltip         = 0
              + links                = []
              + liveNow              = false
              + panels               = [
                  + {
                      + datasource  = {
                          + type = "influxdb"
                          + uid  = "xLNPLcX7z"
                        }
                      + description = "Air sensor sample data from InfluxDB https://docs.influxdata.com/influxdb/cloud/reference/sample-data/#air-sensor-sample-data"
                      + fieldConfig = {
                          + defaults  = {
                              + color      = {
                                  + mode = "palette-classic"
                                }
                              + custom     = {
                                  + axisLabel         = ""
                                  + axisPlacement     = "auto"
                                  + barAlignment      = 0
                                  + drawStyle         = "line"
                                  + fillOpacity       = 0
                                  + gradientMode      = "none"
                                  + hideFrom          = {
                                      + legend  = false
                                      + tooltip = false
                                      + viz     = false
                                    }
                                  + lineInterpolation = "linear"
                                  + lineStyle         = {
                                      + fill = "solid"
                                    }
                                  + lineWidth         = 1
                                  + pointSize         = 5
                                  + scaleDistribution = {
                                      + type = "linear"
                                    }
                                  + showPoints        = "auto"
                                  + spanNulls         = false
                                  + stacking          = {
                                      + group = "A"
                                      + mode  = "none"
                                    }
                                  + thresholdsStyle   = {
                                      + mode = "off"
                                    }
                                }
                              + mappings   = []
                              + thresholds = {
                                  + mode  = "absolute"
                                  + steps = [
                                      + {
                                          + color = "green"
                                          + value = null
                                        },
                                      + {
                                          + color = "red"
                                          + value = 80
                                        },
                                    ]
                                }
                            }
                          + overrides = [
                              + {
                                  + __systemRef = "hideSeriesFrom"
                                  + matcher     = {
                                      + id      = "byNames"
                                      + options = {
                                          + mode     = "exclude"
                                          + names    = [
                                              + "co TLM0102",
                                            ]
                                          + prefix   = "All except:"
                                          + readOnly = true
                                        }
                                    }
                                  + properties  = [
                                      + {
                                          + id    = "custom.hideFrom"
                                          + value = {
                                              + legend  = false
                                              + tooltip = false
                                              + viz     = true
                                            }
                                        },
                                    ]
                                },
                            ]
                        }
                      + gridPos     = {
                          + h = 17
                          + w = 24
                          + x = 0
                          + y = 0
                        }
                      + options     = {
                          + legend  = {
                              + calcs       = []
                              + displayMode = "list"
                              + placement   = "bottom"
                            }
                          + tooltip = {
                              + mode = "single"
                              + sort = "none"
                            }
                        }
                      + targets     = [
                          + {
                              + datasource = {
                                  + type = "influxdb"
                                  + uid  = "xLNPLcX7z"
                                }
                              + query      = <<-EOT
                                    import "influxdata/influxdb/sample"
                                    sample.data(set: "airSensor")
                                    	|> range(start: v.timeRangeStart, stop: v.timeRangeStop)
                                      |> filter(fn: (r) => r["_measurement"] == "airSensors")
                                      |> filter(fn: (r) => r["_field"] == "temperature" or r["_field"] == "humidity" or r["_field"] == "co")
                                EOT
                              + refId      = "A"
                            },
                        ]
                      + title       = "Air Sensors"
                      + type        = "timeseries"
                    },
                ]
              + refresh              = false
              + schemaVersion        = 36
              + style                = "dark"
              + tags                 = []
              + templating           = {
                  + list = []
                }
              + time                 = {
                  + from = "2022-06-21T17:05:46.978Z"
                  + to   = "2022-06-21T17:53:35.857Z"
                }
              + timepicker           = {}
              + timezone             = ""
              + title                = "YOLO Cloud Demos"
              + uid                  = "9uimasdas"
              + weekStart            = ""
            }
        )
      + dashboard_id = (known after apply)
      + folder       = (known after apply)
      + id           = (known after apply)
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # grafana_data_source.influxdb will be created
  + resource "grafana_data_source" "influxdb" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + database_name      = "test"
      + id                 = (known after apply)
      + is_default         = false
      + name               = "influxdb"
      + password           = (sensitive value)
      + type               = "influxdb"
      + uid                = (known after apply)
      + url                = "https://influxdb.test.com"
      + username           = "username"
    }

  # grafana_folder.Demos will be created
  + resource "grafana_folder" "Demos" {
      + id    = (known after apply)
      + title = "Demos"
      + uid   = "12345"
      + url   = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```